scripts/artillery-login-stress.yml
config:
  target: "https://towerpower.vercel.app"
  phases:
    - duration: 15
      arrivalRate: 5
      rampTo: 30
      name: "Rampa de carga inicial (Stress)"
  defaults:
    headers:
      content-type: "application/json"

scenarios:
  - name: "Simulación de inicio de sesión (POST)"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "devops-test@towerpower.com"
            password: "ClaveInvalidaParaPruebas123!"